# CHAP-07:DATA CLEANING AND PREPARATION

## Handling missing data

In [2]:
#if missing data(NaN) is minor then those values can be filled by average etc
#if missing data is very large then replace/remove that particular record
#2 methods either filter out or fill

In [7]:
import pandas as pd
import numpy as np

In [8]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
from numpy import nan as NA    #if we don't import then ([1,2,3,4,5,np.nan])
s1=pd.Series([1,2,3,4,5,NA])

In [12]:
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [14]:
s1.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [15]:
s1[s1.isnull()]

5   NaN
dtype: float64

In [17]:
s1.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [18]:
s1[s1.notnull()]

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [26]:
s1 = s1[s1.notnull()]           #pythonic way,  numpy way is dropna
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [19]:
ss1=pd.Series([1,NA,5,2,NA,67,23,NA,2])
ss1.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7     True
8    False
dtype: bool

In [20]:
ss1

0     1.0
1     NaN
2     5.0
3     2.0
4     NaN
5    67.0
6    23.0
7     NaN
8     2.0
dtype: float64

In [21]:
ss1.dropna()

0     1.0
2     5.0
3     2.0
5    67.0
6    23.0
8     2.0
dtype: float64

In [22]:
ss1

0     1.0
1     NaN
2     5.0
3     2.0
4     NaN
5    67.0
6    23.0
7     NaN
8     2.0
dtype: float64

In [23]:
ss1=ss1.dropna()

In [24]:
ss1

0     1.0
2     5.0
3     2.0
5    67.0
6    23.0
8     2.0
dtype: float64

In [27]:
ss1.index = [0,1,2,3,4,5]        #to change index of ss1

In [28]:
ss1

0     1.0
1     5.0
2     2.0
3    67.0
4    23.0
5     2.0
dtype: float64

In [29]:
# we can also use reset_index to change index
# ss1.reset_index()   but it is a dataframe function so it will return dataframe

In [31]:
s2=pd.Series([1,NA,45,23,NA,45])
s2.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
dtype: bool

In [33]:
s2.dropna()     #but it will not replae in memory /no replacement in original series

0     1.0
2    45.0
3    23.0
5    45.0
dtype: float64

In [34]:
s2

0     1.0
1     NaN
2    45.0
3    23.0
4     NaN
5    45.0
dtype: float64

In [35]:
s2.dropna(inplace=True)     #for removing NA in memory

In [36]:
s2

0     1.0
2    45.0
3    23.0
5    45.0
dtype: float64

In [37]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [38]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [40]:
data.dropna(how="all")   #it drops na when all values are na in particular row

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [41]:
data.dropna(how="any")   #it drops na if anyone value is NA in particular row

     0    1    2
0  1.0  6.5  3.0

In [42]:
data.dropna(thresh=2)
#thresh doesn't look at NA but values i.e if thresh=2 then in data if 2 values are other than NA then record will remain

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [46]:
data.dropna(thresh=2 ,axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [48]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.668640       NaN       NaN
1  0.024662       NaN       NaN
2 -1.089321       NaN  0.066599
3 -1.626373       NaN  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [49]:
df.fillna(0)      #only runtime replacement

          0         1         2
0  0.668640  0.000000  0.000000
1  0.024662  0.000000  0.000000
2 -1.089321  0.000000  0.066599
3 -1.626373  0.000000  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [50]:
df

          0         1         2
0  0.668640       NaN       NaN
1  0.024662       NaN       NaN
2 -1.089321       NaN  0.066599
3 -1.626373       NaN  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [51]:
#by using dictionary
df.fillna({1: 1, 2:2})     #first 1 show column name and replace column 1's null value with 1

          0         1         2
0  0.668640  1.000000  2.000000
1  0.024662  1.000000  2.000000
2 -1.089321  1.000000  0.066599
3 -1.626373  1.000000  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [52]:
df.mean()

0   -0.392584
1   -0.047765
2    0.543320
dtype: float64

In [53]:
df.fillna(df.mean())       #replace NA with partiular column mean

          0         1         2
0  0.668640 -0.047765  0.543320
1  0.024662 -0.047765  0.543320
2 -1.089321 -0.047765  0.066599
3 -1.626373 -0.047765  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [54]:
df

          0         1         2
0  0.668640       NaN       NaN
1  0.024662       NaN       NaN
2 -1.089321       NaN  0.066599
3 -1.626373       NaN  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [56]:
df.fillna({1: df[1].mean() , 2: df[2].mean()})

          0         1         2
0  0.668640 -0.047765  0.543320
1  0.024662 -0.047765  0.543320
2 -1.089321 -0.047765  0.066599
3 -1.626373 -0.047765  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [57]:
df.fillna(method='bfill')      #backward fill : starts from last and fill NA with the folloeing value

          0         1         2
0  0.668640 -0.834331  0.066599
1  0.024662 -0.834331  0.066599
2 -1.089321 -0.834331  0.066599
3 -1.626373 -0.834331  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [58]:
df.fillna(method='ffill')       #ffill= forward fill

          0         1         2
0  0.668640       NaN       NaN
1  0.024662       NaN       NaN
2 -1.089321       NaN  0.066599
3 -1.626373       NaN  1.152859
4  0.474535 -0.834331  0.520786
5 -0.490754 -0.492165  0.535713
6 -0.709476  1.183199  0.440644

In [59]:
df1 = pd.DataFrame(np.random.randn(7, 3))
df1.iloc[2:4,1]=NA
df1.iloc[3:5,2]=NA
df1

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263       NaN  0.756464
3  0.552521       NaN       NaN
4  1.314589  0.532474       NaN
5 -0.356940 -1.030123 -0.629536
6 -0.247491 -1.593114  1.433160

In [60]:
df1.fillna(method='ffill')

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263 -0.789630  0.756464
3  0.552521 -0.789630  0.756464
4  1.314589  0.532474  0.756464
5 -0.356940 -1.030123 -0.629536
6 -0.247491 -1.593114  1.433160

In [63]:
df1.fillna(method='bfill')

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263  0.532474  0.756464
3  0.552521  0.532474 -0.629536
4  1.314589  0.532474 -0.629536
5 -0.356940 -1.030123 -0.629536
6 -0.247491 -1.593114  1.433160

In [69]:
df1[1][5]=NA
df1

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263       NaN  0.756464
3  0.552521       NaN       NaN
4  1.314589  0.532474       NaN
5 -0.356940       NaN -0.629536
6 -0.247491 -1.593114  1.433160

In [70]:
df1.fillna(method='ffill')

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263 -0.789630  0.756464
3  0.552521 -0.789630  0.756464
4  1.314589  0.532474  0.756464
5 -0.356940  0.532474 -0.629536
6 -0.247491 -1.593114  1.433160

In [71]:
df1.fillna(method='bfill')

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263  0.532474  0.756464
3  0.552521  0.532474 -0.629536
4  1.314589  0.532474 -0.629536
5 -0.356940 -1.593114 -0.629536
6 -0.247491 -1.593114  1.433160

In [72]:
df1

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263       NaN  0.756464
3  0.552521       NaN       NaN
4  1.314589  0.532474       NaN
5 -0.356940       NaN -0.629536
6 -0.247491 -1.593114  1.433160

In [74]:
df1.fillna(method='ffill',limit=1)     #if 2 consecutive NaN occur then only 1 value

          0         1         2
0 -0.331053  0.547797 -0.139573
1  0.176047 -0.789630 -0.900531
2  1.328263 -0.789630  0.756464
3  0.552521       NaN  0.756464
4  1.314589  0.532474       NaN
5 -0.356940  0.532474 -0.629536
6 -0.247491 -1.593114  1.433160

In [75]:
df1[2]=np.nan

In [76]:
df1

          0         1   2
0 -0.331053  0.547797 NaN
1  0.176047 -0.789630 NaN
2  1.328263       NaN NaN
3  0.552521       NaN NaN
4  1.314589  0.532474 NaN
5 -0.356940       NaN NaN
6 -0.247491 -1.593114 NaN

In [77]:
df1.fillna(method='ffill')

          0         1   2
0 -0.331053  0.547797 NaN
1  0.176047 -0.789630 NaN
2  1.328263 -0.789630 NaN
3  0.552521 -0.789630 NaN
4  1.314589  0.532474 NaN
5 -0.356940  0.532474 NaN
6 -0.247491 -1.593114 NaN

In [78]:
df1.fillna(method='bfill')

          0         1   2
0 -0.331053  0.547797 NaN
1  0.176047 -0.789630 NaN
2  1.328263  0.532474 NaN
3  0.552521  0.532474 NaN
4  1.314589  0.532474 NaN
5 -0.356940 -1.593114 NaN
6 -0.247491 -1.593114 NaN

In [79]:
data1 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data1

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [83]:
data1.duplicated()      #it return true or false   o/p first time gives false and second time repeat hua islye true

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [86]:
data1.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [88]:
data1.drop_duplicates(['k1'])   #only return first one and first two

    k1  k2
0  one   1
1  two   1

In [89]:
data1.drop_duplicates(['k2'])     #only return first 1,2,3,4

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [90]:
data1.drop_duplicates(['k1','k2'])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [91]:
data2=pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
                      'pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [92]:
data2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [94]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
meat_to_animal['bacon']

'pig'

In [99]:
data2['food']

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [101]:
lowercased=data2['food'].str.lower()

In [102]:
a=lambda x: x.upper()

In [105]:
lowercased.map(a)         #map only apply on series and not on dataframe
#map perform iterations on its own ,no need to  apply loop

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [107]:
data2['animal'] = lowercased.map(meat_to_animal)

In [109]:
data2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [111]:
data3 = pd.Series([1., -999., 2., -999., -1000., 3.])
data3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [113]:
data3.replace(-999,np.nan)          #replae -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [116]:
#by using array
data3.replace([-999, -1000], [np.nan,0])    #replace -999 with nan and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [118]:
#by using key and value
data3.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [119]:
data4 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [120]:
data4

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [121]:
data4.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [122]:
transform = lambda x: x[:4].upper()

In [123]:
data4.index.map(transform)                  #no updation in original data

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [124]:
data4

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [125]:
data4.index=data4.index.map(transform)     #now indexes will update

In [126]:
data4

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [128]:
data4.rename(index=str.title, columns=str.upper , inplace=True)    #no updation in original data without inplace=True

In [129]:
data4

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11